inventory_service_perf/wrk_report/inventory_python310_metrics_info_logger_wrk.txt
dr@eniac-bench:~/devel/wrk2$ ./wrk  --latency -t1 -R1200  -c 100 -d 120  http://eniac-bench:8080/metrics
Running 2m test @ http://eniac-bench:8080/metrics
  1 threads and 100 connections
  Thread calibration: mean lat.: 2.378ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50ms    2.71ms  31.71ms   97.27%
    Req/Sec     1.24k   122.81     1.67k    73.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.06ms
 75.000%    2.59ms
 90.000%    3.16ms
 99.000%   19.07ms
 99.900%   29.55ms
 99.990%   31.01ms
 99.999%   31.57ms
100.000%   31.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.751     0.000000            1         1.00
       1.258     0.100000        13154         1.11
       1.543     0.200000        26284         1.25
       1.726     0.300000        39480         1.43
       1.889     0.400000        52571         1.67
       2.063     0.500000        65769         2.00
       2.153     0.550000        72399         2.22
       2.241     0.600000        78842         2.50
       2.349     0.650000        85464         2.86
       2.465     0.700000        92051         3.33
       2.593     0.750000        98581         4.00
       2.661     0.775000       101915         4.44
       2.737     0.800000       105177         5.00
       2.815     0.825000       108422         5.71
       2.899     0.850000       111695         6.67
       3.001     0.875000       115035         8.00
       3.079     0.887500       116649         8.89
       3.165     0.900000       118285        10.00
       3.271     0.912500       119929        11.43
       3.393     0.925000       121545        13.33
       3.569     0.937500       123207        16.00
       3.671     0.943750       124010        17.78
       3.813     0.950000       124843        20.00
       3.955     0.956250       125664        22.86
       4.119     0.962500       126485        26.67
       4.587     0.968750       127299        32.00
       4.859     0.971875       127706        35.56
       6.815     0.975000       128115        40.00
       9.063     0.978125       128528        45.71
      11.303     0.981250       128937        53.33
      13.631     0.984375       129347        64.00
      15.039     0.985938       129553        71.11
      16.527     0.987500       129760        80.00
      18.143     0.989062       129964        91.43
      19.663     0.990625       130170       106.67
      21.327     0.992188       130375       128.00
      22.015     0.992969       130478       142.22
      22.879     0.993750       130579       160.00
      23.583     0.994531       130686       182.86
      24.575     0.995313       130785       213.33
      25.775     0.996094       130887       256.00
      26.287     0.996484       130939       284.44
      26.783     0.996875       130990       320.00
      27.327     0.997266       131041       365.71
      27.823     0.997656       131094       426.67
      28.287     0.998047       131144       512.00
      28.543     0.998242       131171       568.89
      28.783     0.998437       131196       640.00
      29.039     0.998633       131221       731.43
      29.407     0.998828       131251       853.33
      29.567     0.999023       131272      1024.00
      29.663     0.999121       131285      1137.78
      29.775     0.999219       131299      1280.00
      29.871     0.999316       131311      1462.86
      29.983     0.999414       131324      1706.67
      30.111     0.999512       131336      2048.00
      30.191     0.999561       131343      2275.56
      30.287     0.999609       131350      2560.00
      30.383     0.999658       131356      2925.71
      30.511     0.999707       131362      3413.33
      30.591     0.999756       131369      4096.00
      30.703     0.999780       131375      4551.11
      30.703     0.999805       131375      5120.00
      30.863     0.999829       131378      5851.43
      30.895     0.999854       131382      6826.67
      30.911     0.999878       131384      8192.00
      30.927     0.999890       131386      9102.22
      31.007     0.999902       131388     10240.00
      31.055     0.999915       131389     11702.86
      31.103     0.999927       131391     13653.33
      31.135     0.999939       131392     16384.00
      31.151     0.999945       131393     18204.44
      31.183     0.999951       131394     20480.00
      31.247     0.999957       131395     23405.71
      31.295     0.999963       131396     27306.67
      31.295     0.999969       131396     32768.00
      31.439     0.999973       131398     36408.89
      31.439     0.999976       131398     40960.00
      31.439     0.999979       131398     46811.43
      31.439     0.999982       131398     54613.33
      31.439     0.999985       131398     65536.00
      31.567     0.999986       131399     72817.78
      31.567     0.999988       131399     81920.00
      31.567     0.999989       131399     93622.86
      31.567     0.999991       131399    109226.67
      31.567     0.999992       131399    131072.00
      31.727     0.999993       131400    145635.56
      31.727     1.000000       131400          inf
#[Mean    =        2.503, StdDeviation   =        2.705]
#[Max     =       31.712, Total count    =       131400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143751 requests in 2.00m, 1.01GB read
Requests/sec:   1197.92
Transfer/sec:      8.64MB