inventory_service_perf/wrk_report/inventory_python310_read_1200.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 5.285ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.19ms    4.22ms  69.50ms   75.81%
    Req/Sec     1.23k   328.28     2.32k    60.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.85ms
 75.000%    9.09ms
 90.000%   11.54ms
 99.000%   13.18ms
 99.900%   28.83ms
 99.990%   56.64ms
 99.999%   68.35ms
100.000%   69.57ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.703     0.000000            1         1.00
       1.383     0.100000        13161         1.11
       1.641     0.200000        26291         1.25
       1.894     0.300000        39438         1.43
       2.233     0.400000        52566         1.67
       2.849     0.500000        65730         2.00
       3.527     0.550000        72271         2.22
       4.971     0.600000        78842         2.50
       6.615     0.650000        85419         2.86
       7.911     0.700000        91987         3.33
       9.087     0.750000        98585         4.00
       9.671     0.775000       101852         4.44
      10.143     0.800000       105148         5.00
      10.535     0.825000       108442         5.71
      10.911     0.850000       111739         6.67
      11.247     0.875000       115014         8.00
      11.399     0.887500       116634         8.89
      11.543     0.900000       118274        10.00
      11.679     0.912500       119925        11.43
      11.815     0.925000       121543        13.33
      11.967     0.937500       123253        16.00
      12.039     0.943750       124010        17.78
      12.119     0.950000       124843        20.00
      12.215     0.956250       125691        22.86
      12.319     0.962500       126500        26.67
      12.439     0.968750       127329        32.00
      12.503     0.971875       127701        35.56
      12.583     0.975000       128133        40.00
      12.663     0.978125       128520        45.71
      12.767     0.981250       128952        53.33
      12.887     0.984375       129357        64.00
      12.951     0.985938       129549        71.11
      13.023     0.987500       129752        80.00
      13.127     0.989062       129960        91.43
      13.231     0.990625       130171       106.67
      13.399     0.992188       130378       128.00
      13.487     0.992969       130478       142.22
      13.583     0.993750       130582       160.00
      13.719     0.994531       130677       182.86
      13.927     0.995313       130779       213.33
      14.287     0.996094       130882       256.00
      14.967     0.996484       130933       284.44
      16.255     0.996875       130984       320.00
      17.567     0.997266       131035       365.71
      19.311     0.997656       131087       426.67
      21.279     0.998047       131138       512.00
      22.303     0.998242       131164       568.89
      23.711     0.998437       131189       640.00
      25.919     0.998633       131215       731.43
      27.423     0.998828       131241       853.33
      29.087     0.999023       131266      1024.00
      30.287     0.999121       131279      1137.78
      31.535     0.999219       131292      1280.00
      32.831     0.999316       131305      1462.86
      33.503     0.999414       131318      1706.67
      35.359     0.999512       131330      2048.00
      36.255     0.999561       131337      2275.56
      36.767     0.999609       131343      2560.00
      37.375     0.999658       131350      2925.71
      38.655     0.999707       131356      3413.33
      41.439     0.999756       131362      4096.00
      43.007     0.999780       131366      4551.11
      43.807     0.999805       131369      5120.00
      46.047     0.999829       131372      5851.43
      48.639     0.999854       131375      6826.67
      50.399     0.999878       131378      8192.00
      54.879     0.999890       131380      9102.22
      57.919     0.999902       131382     10240.00
      57.983     0.999915       131383     11702.86
      59.199     0.999927       131385     13653.33
      61.855     0.999939       131386     16384.00
      61.983     0.999945       131387     18204.44
      62.431     0.999951       131388     20480.00
      62.655     0.999957       131389     23405.71
      65.663     0.999963       131390     27306.67
      65.663     0.999969       131390     32768.00
      66.687     0.999973       131391     36408.89
      66.687     0.999976       131391     40960.00
      66.943     0.999979       131392     46811.43
      66.943     0.999982       131392     54613.33
      66.943     0.999985       131392     65536.00
      68.351     0.999986       131393     72817.78
      68.351     0.999988       131393     81920.00
      68.351     0.999989       131393     93622.86
      68.351     0.999991       131393    109226.67
      68.351     0.999992       131393    131072.00
      69.567     0.999993       131394    145635.56
      69.567     1.000000       131394          inf
#[Mean    =        5.189, StdDeviation   =        4.220]
#[Max     =       69.504, Total count    =       131394]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143745 requests in 2.00m, 61.97MB read
Requests/sec:   1197.87
Transfer/sec:    528.77KB